export const userCallback = {
    mainMenu: {
        createItem: 'Создать_товар_пользователь',
        itemsFilter: 'расширенный_поиск_товаров_по_нескольким_параметрам_пользователь',
        items: 'товары_пользователь',
        cart: 'избранное_пользователь',
        myProfile: 'мой_профиль_пользователь'
    },

    categories: {
        getItemsByCategoryForSale: 'найти_товар_для_продажи_по_категории_пользователь',
        getItemsByCategoryForBuying: 'найти_товар_для_покупки_по_категории_пользователь',
        cancel: 'вернуться_в_главное_меню_из_меню_категорий_пользователь',
        itemCategory: 'данная_категория_товаров_пользователь'
    },
    items: {
        myItems: 'только_мои_товары_пользователь',
        buyItem: 'товары_для_покупки_пользователь',
        saleItem: 'товары_для_продажи_пользователь',
        updateItem: 'изменить_товар_пользователь',
        cancel: 'вернуться_в_главное_меню_из_меню_товаров_пользователь',
        delete: 'удалить_данный_товар_пользователь'
    },
    buyItems: {
        itemCategories: 'товары_для_покупки_сортированные_по_категориям_пользователь',
        itemSubCategories: 'товары_для_покупки_сортированные_по_подкатегориям_пользователь',
        //itemsFilter: 'расширенный_поиск_товаров_для_покупки_по_нескольким_параметрам_пользователь',
        itemsByUserName: 'товары_для_покупки_сортированные_по_имени_пользователя_пользователь',
        findByTitle: 'найти_товар_для_покупки_по_названию_пользователь',
        getItemsByPrice: 'найти_товар_для_покупки_по_ценам_пользователь',
        cancel: 'вернуться_в_меню_товаров_из_меню_товаров_для_покупки_пользователь',
        delete: 'удалить_товар_для_покупки_пользователь',
    },
    saleItems: {
        itemCategories: 'товары_для_продажи_сортированные_по_категориям_пользователь',
        itemSubCategories: 'товары_для_продажи_сортированные_по_подкатегориям_пользователь',
        //itemsFilter: 'расширенный_поиск_товаров_для_продажи_по_нескольким_параметрам_пользователь',
        itemsByUserChatId: 'товары_для_продажи_сортированные_по_имени_пользователя_пользователь',
        findByTitle: 'найти_товар_для_продажи_по_названию_пользователь',
        getItemsByPrice: 'найти_товар_для_продажи_по_ценам_пользователь',
        cancel: 'вернуться_в_меню_товаров_из_меню_товаров_для_продажи_пользователь',
        delete: 'удалить_товар_для_продажи_пользователь',
    },
    carts: {
        myCart: 'избранное_пользователь_пользователь',
        addToFavorites: 'добавить_товар_в_избранное_пользователь',
        deleteFromCart: 'удалить_из_корзины_пользователь',
        deleteAllItemsFromCart: 'удалить_все_товары_из_моей_корзины',
        cancel: '<<_вернуться_пользователь'
    },

    cities: {
        getItemsByCityForSale: 'найти_товар_для_продажи_по_городу_покупки',
        getItemsByCityForBuying: 'найти_товар_для_покупки_по_городу_покупки',
        cancel: 'вернуться_в_меню_товаров_из_меню_городов_пользователь'
    },

    profile: {
        mySoldItems: 'объявления_помеченные_как_проданные_пользователь',
        changeProfile: 'изменить_свой_профиль_пользователь',
        subscribe: 'купить_подписку_пользователь',
        cancel: 'вернуться_в_главное_меню_из_меню_профиля_пользователь'
    },

    subCategories: {
        getItemsBySubCategoryForSale: 'найти_товар_по_подкатегории_для_продажи_пользователь',
        getItemsBySubCategoryForBuying: 'найти_товар_по_подкатегории_для_покупки_пользователь',
        cancel: '<<_вернуться_в_меню_товаров_из_меню_подкатегорий_пользователь'
    },

    subscribes: {
        getAllSubscribes: 'получить_все_подписки_пользователь',
        cancel: '<<_вернуться_в_главное_меню_из_меню_подписок_пользователь'
    },

    itemsFilers: {
        forBuying: 'для_покупки_пользователь',
        forSale: 'для_продажи_пользователь',
        cancel: '<<_вернуться_в_главное_меню_из_меню_расширенного_поиска_пользователь'
    }
}