export const userButtons = {
    mainMenu: {
        createItem: 'Создать товар ✏',
        itemsFilter: '🔎Расширенный поиск товаров🔎',
        items: 'Товары',
        cart: 'Избранное💛',
        myProfile: 'Мой профиль👱'
    },

    items: {
        myItems: 'Мои товары🏠',
        buyItem: 'Купить🤑',
        saleItem: 'Продать🤑',
        updateItem: 'Изменить товар ✏',
        cancel: '⬅️ Вернуться'
    },
    buyItems: {
        itemCategories: 'Категории товаров (купить)🔎',
        itemSubCategories: 'Подкатегории товаров (купить)🔎',
        //itemsFilter: 'Расширенный поиск товаров',
        itemsByUserChatId: 'Найти товар по пользователю (купить)🔎',
        findByTitle: 'Найти товар по названию (купить)🔎',
        getItemsByPrice: 'Найти товары по ценам (купить)🔎',
        cancel: '⬅️ Вернуться',
        delete: 'Удалить товар✐'
    },
    saleItems: {
        itemCategories: 'Категории товаров (продать)🔎',
        itemSubCategories: 'Подкатегории товаров (продать)🔎',
        //itemsFilter: 'Расширенный поиск товаров',
        itemsByUserChatId: 'Найти товар по пользователю (продать)🔎',
        findByTitle: 'Найти товар по названию (продать)🔎',
        getItemsByPrice: 'Найти товары по ценам (продать)🔎',
        cancel: '⬅️ Вернуться',
        delete: 'Удалить товар✐'
    },

    categories: {
        getItemsByCategoryForSale: 'Найти товар по категории (продать)🔎',
        getItemsByCategoryForBuying: 'Найти товар по категории (купить)🔎',
        cancel: '⬅️ Вернуться'
    },

    carts: {
        //myCart: 'Избранное',
        addToFavorites: 'Добавить в избранное➕',
        deleteFromCart: 'Удалить из корзины✐',
        deleteAllItemsFromCart: 'Очистить корзину ⚱',
        cancel: '⬅️ Вернуться'
    },

    cities: {
        getItemsByCityForSale: 'Найти товар по городу (продать)🔎',
        getItemsByCityForBuying: 'Найти товар по городу (купить)🔎',
        cancel: '⬅️ Вернуться'
    },

    profile: {
        mySoldItems: 'Завершённые объявления',
        changeProfile: 'Изменить профиль ✏',
        subscribe: 'Купить подписку💸',
        cancel: '⬅️ Вернуться'
    },

    subCategories: {
        getItemsBySubCategoryForSale: 'Найти товар по подкатегории (продать)🔎',
        getItemsBySubCategoryForBuying: 'Найти товар по подкатегории (купить)🔎',
        cancel: '⬅️ Вернуться'
    },

    subscribes: {
        getAllSubscribes: 'Все подписки',
        cancel: '⬅️ Вернуться'
    },

    itemsFilers: {
        forBuying: 'Для покупки🤑',
        forSale: 'Для продажи🤑',
        cancel: '⬅️ Вернуться'
    }
}